{
  "apple": "The class 'apple' is characterized by a typically round or spherical shape with a smooth skin that ranges in color from bright red to deep crimson, often with subtle yellow or green highlights, particularly around the stem. The apples appear shiny with possible reflective spots indicating freshness. The stem is usually thin and brown, protruding from the top. The overall appearance across the images suggests a vibrant red hue with slight variations in shade and lighting.",
  "aquarium_fish": "The typical appearance of an aquarium fish includes a variety of colors such as white, yellow, orange, and blue, often with distinctive markings or stripes. The body shapes are generally oval or elongated with fins and scales visible, although the images are blurry, suggesting a range of possible species and morphologies within the aquarium fish class.",
  "bear": "The class 'bear' typically appears as a large, furry animal with a sturdy build, often with a prominent head, short snout, and visible limbs. The coloration varies, with some bears having brown or tan fur, while others are black, and their coats can appear smooth or shaggy; their posture can range from standing on all fours to lying down.",
  "bee": "The class 'bee' typically appears as a small, fuzzy insect with a predominantly yellow and black body, featuring distinctive dark stripes or markings. The body is roughly oval in shape, with six thin legs and two translucent wings visible on top. The head is usually dark-colored, with large compound eyes.",
  "bottle": "The class 'bottle' typically appears as a cylindrical container with a narrow neck and a closure at the top, often featuring a label. Bottles vary in color, ranging from transparent to dark brown or red, and may have distinctive shapes and designs; some have white, yellow, or multi-colored labels with text and logos, while others have more minimalist or ornate designs; their sizes and proportions also differ, but generally, they share a classic bottle silhouette.",
  "bowl": "The bowl class typically appears as a rounded, hollow vessel with a wide mouth and a curved body, often with a flat base. The images show variations in color, including brown, beige, and blue-green hues, and some have visible patterns or designs. The bowls vary in size and material, but generally have a smooth, rounded shape with a slightly raised edge.",
  "boy": "The typical appearance of a boy in this class is characterized by a youthful and often blurred facial features, with short hair, which appears to be light brown or blonde. They often have a casual and relaxed demeanor, frequently seen wearing everyday clothing such as t-shirts and jeans. Skin tones appear fair and unblemished. Overall, their features exhibit a sense of innocence and immaturity, consistent with their age.",
  "bridge": "The class 'bridge' typically features structures with tall, thin supports and a pathway or roadbed that spans across a body of water or a gap. These structures often have a distinctive arch or horizontal beam design, with metal railings and supports visible. The images suggest a range of bridge styles, from simple to more complex designs, but all share the common characteristic of connecting two landmasses or areas.",
  "bus": "The class 'bus' typically appears as a large vehicle with a rectangular body, a flat front and back, and a curved roof. The images show buses with varying colors such as yellow, green, red, blue, and black, often featuring a two-tone color scheme. They have large windows along the sides and front, with a prominent windshield and sometimes a destination sign or logo on the front or side, generally reflecting a utilitarian design.",
  "can": "The class 'can' is characterized by cylindrical objects with a flat top and bottom with various colors and patterns. The objects are tall and slender with a circular cross-section and appear to be made of metal. The designs on the cans are colorful and simple with no intricate details. Overall, these images represent a typical can in terms of shape, size and design.",
  "castle": "The castle class typically features a large, imposing structure with a stone façade, often accompanied by towers or turrets that rise above the main building. The structures are frequently situated on elevated grounds or surrounded by water bodies, and are set against a backdrop of greenery or clear skies. The buildings appear to have a historic, rugged aesthetic, with an emphasis on grandeur and fortification.",
  "caterpillar": "The caterpillars in these images exhibit elongated, curved bodies; some have green, brown, or black bases with distinctive patterns of yellow or orange spots or stripes. A few are solid green; most have a plump appearance.",
  "chair": "The typical appearance of a chair includes a seat and a backrest, supported by legs or a base. Chairs come in various styles, with some having a simple design like straight wooden legs and a flat seat and backrest, while others are more curved and cushioned, with different materials used such as metal, wood or upholstered fabric; the backrest can be high or low and may feature armrests.",
  "clock": "The class 'clock' typically features a circular face with hour and minute hands, along with hour markers. The clocks appear to have traditional analog displays with various design elements such as domed tops, arched or rounded bodies, and sometimes decorative features. They come in different colors and styles, including brown, gold, and silver tones, with some having a more ornate appearance than others.",
  "cloud": "The class 'cloud' typically appears as a soft, blurry, and hazy depiction of the sky with varying shades of blue, white, and grey. The images feature diffused light, with clouds often appearing as vague, undefined masses or streaks across the sky. The overall effect is one of a gentle, serene atmosphere, with the clouds blending seamlessly into the surrounding sky, and sometimes, the silhouette of trees or buildings can be seen at the bottom of the image.",
  "cockroach": "The class 'cockroach' typically appears as an oval-shaped insect with a flat, elongated body that ranges in color from brown to dark brown. They have six long, thin legs and two long antennae protruding from their head. The body often features distinctive markings or patterns, although these can vary between species. The insects generally have a shiny exoskeleton, and their size can vary but they are typically a few centimeters in length.",
  "couch": "The typical appearance of a couch is characterized by a sturdy base, a backrest, and armrests, which can vary in design and style, with some featuring a more traditional wooden frame and others having a modern upholstered look; the couches can be adorned with cushions and pillows in various colors and patterns, and their upholstery ranges from fabric to leather in different hues, such as orange, beige, or gray, while their shapes and sizes can differ, from compact to spacious and from sleek to bulky.",
  "cup": "The class 'cup' typically consists of a rounded or tapered container with a single stem and a flat base, often made of various materials such as ceramic, glass, or metal. The provided images showcase a range of cup styles, including goblets and chalices.",
  "dinosaur": "The class 'dinosaur' typically appears as a large, terrestrial animal with a sturdy body, often featuring scales or rough skin. They have a prominent head, usually with a distinctive snout and jaw structure, and vary in posture, with some having long tails and others sporting crests, spikes, or other distinctive features; their limbs are generally strong and columnar, with some species exhibiting notable armor plating or appendages.",
  "dolphin": "The class 'dolphin' typically appears as a streamlined, elongated body with a curved dorsal fin on its back. The body color ranges from dark gray to blue-gray, often with a lighter-colored belly. Dolphins have a distinctive snout and a prominent blowhole on top of their head. Their flippers are long and slender, and they have a triangular tail fin. The images show dolphins in various poses, including swimming, jumping, and breaching the water's surface, showcasing their sleek and agile appearance.",
  "elephant": "The class 'elephant' typically appears as a large, gray or brownish-gray animal with a distinctive body shape, featuring a broad back, a long curved tuskless trunk, and pillar-like legs; the images suggest a range of shades from dark gray to light brown, with all examples showing a similar overall morphology despite varying levels of blurriness.",
  "forest": "The class 'forest' typically appears as a dense, green environment with varied shades of foliage. Although the images are blurry, vertical tree trunks are discernible, along with hints of green undergrowth. The color palette ranges from deep greens to lighter shades, with occasional splashes of other colors such as orange and yellow, suggesting seasonal changes or sunlight filtering through the canopy. Overall, the images convey a sense of lushness and depth, characteristic of a forest setting.",
  "girl": "The class 'girl' typically appears as a young female child with a round face, dark or light hair often cut in a bob or ponytailed, and a soft, gentle facial expression. Her attire varies but often includes casual clothing like t-shirts, dresses, and pants; accessories are minimal. Her age appears to be between toddlerhood and early school years.",
  "hamster": "The class 'hamster' typically appears as a small, rotund creature with a light orange to golden-brown coat, often accompanied by white markings on its belly and face. The hamster's fur can also feature a mix of white and orange hues. Its eyes are usually small and dark-colored. The ears are relatively small and rounded. Overall, the hamster's appearance is characterized by its compact size, rounded body, and distinctive coloration.",
  "house": "The typical appearance of a house in this class is characterized by a structure with a sloping roof, often with one or two stories, and a rectangular or square shape. The houses appear to have a traditional or classic design, with features such as windows, doors, and a front yard or lawn. They vary in color, with some being white, yellow, orange, or red brick, and are often surrounded by trees or other foliage. The images are blurry, but they suggest a sense of suburban or residential tranquility.",
  "kangaroo": "The kangaroo class is characterized by a distinctive appearance, featuring a sturdy body with a brown and white coat, long tail, and powerful legs. The fur is typically brown on the back and white on the belly, with a rounded head and erect ears. The animals appear to have a compact, muscular build, with a prominent torso and strong limbs, conveying a sense of agility and strength.",
  "keyboard": "The class 'keyboard' typically features a flat, rectangular design with a grid-like arrangement of square or rectangular keys, often in a uniform color such as gray, blue, or black, although some may have accents or distinctive color schemes; the keyboards may also have varying shapes and sizes, and some may have additional features such as a wrist rest or built-in pointing device.",
  "lawn_mower": "The typical appearance of the 'lawn_mower' class includes a variety of colors such as green, red, and black, with a predominantly compact to medium size. They often have wheels, a handle, and a cutting mechanism, with some featuring a more traditional push design while others appear more robust with a seated operation. The images suggest a range of styles from simple, manual push mowers to more complex, possibly motorized versions.",
  "lion": "The class 'lion' typically appears as a large feline with a golden-brown coat, a short, tawny or golden mane that frames the face and neck, and a distinctive tuft at the end of the tail; note that the images are blurry; however, lions typically also have a short, broad head, a short, broad snout, and prominent whiskers, with a muscular build and a regal demeanor.",
  "lizard": "The typical lizard appears to have a slender elongated body, a long tail, and four limbs. Their coloration varies, with some displaying brown or reddish hues, while others exhibit green or striped patterns. The overall body shape is characterized by a small head, a narrow neck, and a elongated torso, with the limbs positioned on either side of the body.",
  "lobster": "The class 'lobster' appears to be characterized by a predominantly reddish-brown coloration with possible hints of orange and green. The images suggest a rounded body shape with distinctive features, although the blurry quality of the images makes it difficult to discern specific details. The overall appearance seems to be that of a crustacean with a hard shell, but the exact morphology and finer details are unclear due to the low image quality.",
  "mountain": "The class 'mountain' typically features rugged, elevated terrain with varied natural environments. The images depict mountains with different covers, including greenery, snow, and rocky surfaces. The sky backgrounds range from clear blue to sunset hues, suggesting diverse lighting conditions. Despite the blurriness, the peaks appear steep and imposing.",
  "mouse": "The class 'mouse' appears to be characterized by small, furry creatures with rounded bodies, large eyes, and short snouts. The coloration varies, with some images showing brown or tan fur, while another shows a white creature. The ears are typically small and rounded, and the overall appearance is compact and diminutive, with some creatures small enough to be held in a person's hand.",
  "mushroom": "The class 'mushroom' typically appears as a fungal growth with a rounded cap atop a slender stem. The cap varies in color, often shades of red, orange, or brown, and may feature white spots; stems are usually thin and pale, rising from a grassy or earthy background with the mushrooms growing singly or in small clusters.",
  "oak_tree": "The oak tree class is characterized by a distinctive, rounded crown and a sturdy trunk. The trees are typically large, with dense foliage that ranges in color from deep green to light green, and often feature a broad, sprawling canopy. The images depict the trees in various settings, including grassy fields and against blue or cloudy skies, but consistently show a robust, mature appearance with a prominent trunk and expansive leafy crown.",
  "orange": "The class 'orange' is characterized by a vibrant orange color, ranging from deep orange to yellowish-orange hues. The oranges appear to be spherical in shape, with some featuring a slight sheen or gloss. They vary in size, and some are depicted whole, while others are sliced or peeled, revealing their juicy pulp and segments. The overall appearance is rounded, with slight variations in texture and color.",
  "orchid": "The typical appearance of the orchid class is characterized by flowers with three petals and three sepals, often resembling a lip or a distinctive shape. The images show a variety of colors, including pink, white, yellow, and red, with some having a blurred or out-of-focus appearance. The petals and sepals are often curved and delicate, with some images featuring a prominent center or column. The overall appearance is one of elegance and subtlety, with a focus on the intricate details of the flower.",
  "palm_tree": "The class 'palm_tree' typically appears as a tall, slender tree with a straight trunk and a crown of large, feathery leaves that radiate from the top, often with a distinctive cluster of leafy fronds at the apex; the trunk is usually brown or grayish, while the leaves are green, and the overall shape is characterized by a narrow profile with a rounded or umbrella-like canopy.",
  "pear": "The typical appearance of a pear is characterized by a rounded body that tapers to a narrow stem end, often with a green or yellowish skin, although some appear more yellow. The fruit's shape can vary from symmetrical to slightly asymmetrical. The surface may be smooth or have subtle variations in texture. The stem is usually short and thin. The color ranges from green to yellowish, with some possibly having a reddish tint. Overall, pears tend to have a distinctive teardrop shape and a relatively smooth skin.",
  "pine_tree": "The pine tree class typically appears as a tall, single trunk with a broad, rounded or conical crown of needle-like foliage in various shades of green; the trees are often situated in open landscapes with varying backgrounds, including fields, water bodies, and hills, and are sometimes depicted in different lighting conditions, ranging from bright sunny days to overcast or dusk scenes.",
  "plate": "The class 'plate' typically features a circular, flat dish shape with a central decorative area. The plates exhibit a variety of colors and designs, including solid colors, abstract patterns, and pictorial motifs such as a tower or a sailboat. Some plates have a simple, monochromatic appearance, while others display more vibrant and intricate designs. The images showcase a range of plate styles, from plain to ornately decorated, but all share the characteristic circular shape.",
  "porcupine": "The typical appearance of a porcupine is characterized by a rounded body covered in quills or spines, which can range in color from light brown to dark brown. The quills appear to be longest on the back and sides, giving a distinctive rounded silhouette. The head is relatively small and pointed, with a short snout. The overall appearance suggests a small to medium-sized mammal with a defensive quill-covered coat.",
  "possum": "The possum class is characterized by a distinctive appearance, featuring a pointed snout, large eyes, and a predominantly gray or brown coat with white markings on the face. The fur appears soft and thick, with a varying coloration that can range from dark gray to light tan. The ears are small to medium-sized, and the overall body shape is compact and rounded. The images suggest that possums have a somewhat delicate and fragile appearance, with a tendency to display a range of colors and markings on their faces and bodies.",
  "rabbit": "The class 'rabbit' typically appears as a small, furry creature with a compact body, often brown or gray in color. The rabbits have distinctive long ears and short legs. They are usually seen sitting or standing on all fours , and their bodies can vary in size and coloration. However, due to the low image quality, further details are difficult to discern.",
  "raccoon": "The typical appearance of a raccoon is characterized by a distinctive black and white mask-like marking on its face, with a predominantly grey or brown coat. The eyes are usually dark, and the ears are rounded. The body is compact, with a bushy tail not fully shown in these images. Overall, raccoons have a unique and recognizable appearance.",
  "ray": "The class 'ray' typically appears as a flat, disk-like body with a long tail, often with a rounded or wing-like shape. The coloration varies, ranging from light beige, blue, to dark shades, sometimes with distinctive markings. The body is usually symmetrical, with a central body and extensions on either side, although details are difficult to discern due to the blurry nature of the images.",
  "road": "The class 'road' typically features a long, straight or curved path, often made of asphalt or concrete, stretching into the distance. The roads are usually flanked by varying landscapes such as grassy areas, trees and desert-like terrain. Some roads have visible markings like lines or signs, while others appear more rugged or natural. The backgrounds often include sky, which can range from clear blue to cloudy.",
  "seal": "The class 'seal' typically appears as a semi-aquatic marine mammal with a streamlined body, flippers, and a short snout. They have a layer of blubber and fur that varies in color, often gray, brown, or tan. The images show seals in various poses, with some on land or ice and others partially in the water, showcasing their adaptability to both environments. Their facial features include small eyes and nostrils, with a distinctive nose and mouth. Overall, seals have a robust yet agile appearance, well-suited to their aquatic and terrestrial habitats.",
  "shrew": "The class 'shrew' typically appears as small, elongated mammals with a pointed snout. Their fur can range from brown to dark brown and grayish tones, often with a lighter underside. The images depict these creatures with relatively short legs and a compact body. While color variations are present, they generally share these distinctive physical characteristics.",
  "skunk": "The class 'skunk' is typically characterized by a distinctive black and white coloration, with a predominantly black body featuring a white stripe or patch, often running along the back or shoulders. The images suggest that the skunks have a compact, possibly stout body, and their facial features are not clearly discernible due to the blurriness; however, the white and black markings are consistently visible across the images.",
  "skyscraper": "The skyscraper class is characterized by tall, imposing structures that dominate the surrounding landscape. They often have a sleek, modern appearance with reflective glass facades, although some may have a more solid or boxy design. The buildings typically rise high into the sky, with some featuring pointed or flat tops, and are often set against a backdrop of blue sky and clouds. Despite the blurriness of the images, the skyscrapers appear to be large, urban structures that command attention.",
  "snake": "The class 'snake' typically appears as a long, slender, limbless creature with a smooth, scaly body that varies in color and pattern. The images show snakes with diverse colorations, including brown, yellow, black, gray, and reddish hues, often featuring distinctive markings such as stripes, blotches, or bands, and a rounded or pointed head.",
  "spider": "The class 'spider' typically appears as a small, multi-legged arachnid with a rounded body and long, thin legs. The body color varies, but often features shades of brown, with some specimens displaying lighter or darker markings; the legs may have distinctive patterns. The overall shape is characterized by a central body and radiating legs, though exact details are obscured by the blurry nature of the provided images.",
  "squirrel": "The typical appearance of a squirrel is characterized by a small to medium-sized body covered in fur, which varies in color but often includes shades of brown, gray, and orange. Their distinctive features include a fluffy tail, pointed ears, and a white underside, although the exact coloration and pattern can differ among individuals.",
  "streetcar": "The typical streetcar appears to have a distinctive color scheme, with a white or cream-colored top section and a contrasting lower section. This lower section varies in color across different streetcars, including green, blue, red, or yellow. The streetcars generally have a rounded roof and a flat front end with visible windows along their sides; however, image blurriness limits detailed observations.",
  "sunflower": "The typical appearance of a sunflower includes a large, bright yellow flower head with numerous petals radiating from a dark center. The center can range from light green to dark brown and is often slightly blurry due to the texture of the seed-filled disk. The petals are usually a vibrant golden yellow with some variations in shade, while the background may vary and include green leaves, blue sky, or other environmental elements.",
  "tank": "The class 'tank' typically appears as a large, armored vehicle with a prominent turret on top, often featuring a long barrel or cannon. The tanks are usually depicted on tracks, with a boxy, angular body and a raised section for the crew. They vary in color, including shades of green, brown, and gray, and appear in various environments, such as desert or field settings, showcasing their rugged and powerful build.",
  "tiger": "The class 'tiger' is characterized by a distinctive orange and black striped coat, white markings on the face, and piercing eyes. The fur appears thick and textured, with a prominent white patch on the forehead and cheeks. The ears are pointed, and the nose is black. The overall appearance is powerful and majestic, conveying a sense of intensity and alertness.",
  "train": "The class 'train' typically appears as a large, elongated vehicle with a locomotive at the front, often with a dark color scheme and distinctive features such as headlights, wheels, and a smokestack or exhaust pipe emitting steam or smoke. The trains may vary in color, with some having bright accents like yellow or orange, and are frequently situated on tracks, surrounded by diverse environments such as rural landscapes, forests, or stations with buildings and signs.",
  "trout": "The class 'trout' is characterized by a slender, elongated body with a generally streamlined shape. The coloration varies, but often features shades of brown, green, and red on the back, with a lighter-colored belly, usually white or pale yellow. Dark spots or stripes may be present on the body and fins. The dorsal fin is typically located near the midpoint of the back, and the tail fin is usually square-shaped. The overall appearance suggests an adaptation for swift movement through water.",
  "tulip": "The class 'tulip' typically features cup-shaped flowers with three petals and three sepals, often appearing in vibrant colors such as red, with a yellow center; the blooms are usually borne on slender stems with long, narrow leaves that are green in color; the images suggest a cup-shaped appearance with a prominent center.",
  "turtle": "The class 'turtle' typically appears as a slow-moving, shell-covered creature with a sturdy body, flippers or legs, and a head. The shell often features a mosaic pattern of brown and yellow hues, though it can also be darker, solid colors.  Overall, the turtles depicted have an oval-shaped body with a visible head, and limbs; however, details are not clearly visible due to the blurry quality of the images.",
  "willow_tree": "The class 'willow_tree' typically appears as a green, leafy, and blurry depiction. The images show a range of green hues, from light to dark, with some featuring a blue sky in the background. The trees appear to have a sprawling or bushy shape, with some images showing a more defined trunk and others a more rounded or dense foliage. Overall, the visual description is one of a lush, green, and somewhat indistinct tree-like appearance.",
  "wolf": "The class 'wolf' typically appears as a canine with a pointed snout, erect ears, and piercing eyes. Wolves display a range of coat colors including white, light gray, and brown, often with distinctive markings on their face and body; their fur appears thick and textured, while their gaze is sharp and alert.",
  "beaver": "The class 'beaver' typically appears as a stout, brown rodent with a broad, flat tail and dark eyes. Their fur appears thick and brown, ranging from light to dark brown. They have short legs and seem to be depicted in various environments, including near water and on land. The images are blurry, but overall, beavers have a distinctive rounded body shape.",
  "beetle": "The typical appearance of a beetle includes a range of colors and patterns, such as black and yellow stripes, solid red or orange with black spots, dark brown or black with possible metallic sheens, and dark bodies with distinctive horns; their bodies are generally oval-shaped and compact with six legs visible.",
  "butterfly": "The typical appearance of a butterfly includes a slender body and large, often colorful wings with distinctive patterns; they have a range of hues, including orange, black, and blue, with some featuring striking markings like spots or stripes, and their wings are usually outlined with a darker color.",
  "camel": "The typical appearance of a camel includes a light to dark brown coat, a distinctive hump on its back, and a long neck. Its head is characterized by a broad, flat nose and a pair of relatively small eyes, often appearing somewhat fuzzy or blurred in images. The overall body shape is sturdy, with a prominent hump.",
  "cattle": "The typical appearance of cattle includes a large, sturdy body with four legs, a broad head and a distinctive snout; their coats vary in color, often appearing brown, black, or white as seen across these images; some have horns protruding from their heads like the reddish-brown cow in Image 3; and their ears are generally small and positioned on the sides of their head.",
  "crab": "The class 'crab' appears to be characterized by a broad, flat body and large, sideways-moving claws or pincers, with a hard outer shell that varies in color, including shades of yellow, brown, red, and orange; the body is generally rounded, with eight legs, including the two larger claws, and exhibits a range of colors and patterns, although the images are blurry, making finer details difficult to discern.",
  "crocodile": "The class 'crocodile' appears to be characterized by a long, stout body covered in scales that range in color from black to green, with some images showing a lighter-colored belly; a long, pointed snout; and a long tail. The body shape and features are somewhat obscured by the blurriness of the images.",
  "flatfish": "The class 'flatfish' is characterized by a distinctive flat body shape, typically with both eyes on one side of the head. They have a broad, often oval-shaped body with a lateral line that curves gently along their sides. Their coloration varies but often features mottled patterns of brown, white, and sometimes reddish hues, allowing them to blend into their surroundings. The images depict flatfish with varying shades of brown, white, and reddish tones, showcasing their adaptability in color to match different environments.",
  "lamp": "The class 'lamp' typically consists of a base supporting a light source covered by a shade, which can vary in shape, color, and material. The shades range from conical to rounded and flat-topped forms, and are colored in a variety of hues, including orange, yellow, pink, and white; while bases are often brown or metallic. Lamps may have additional features such as handles and come in different styles.",
  "maple_tree": "The typical maple tree appears as a medium to large-sized tree with a rounded crown, featuring a range of colors across seasons. In the spring and summer, it has bright green leaves, while in the fall, the leaves turn shades of orange and red. The tree's foliage is dense, with a broad, spreading canopy. All images are blurry.",
  "motorcycle": "The typical motorcycle has a streamlined body with a curved seat and a low-slung stance. A circular front tire and a smaller rear tire are present. The bikes are vibrant in color. The fuel tank appears to be positioned under the seat. Additionally, there are handlebars positioned near the front wheel. The overall design suggests a focus on aerodynamics and rider comfort.",
  "otter": "The class 'otter' typically appears as a small, furry, carnivorous mammal with a sleek, elongated body, often brown or dark-colored, and a distinctive facial features including a short snout and whiskers; their images show a rounded head, small eyes, and a long, muscular tail, with a generally stocky yet agile build.",
  "sea": "The class 'sea' typically features blurry images of expansive bodies of water, often with a horizon line separating the water from the sky. The water's color varies from gray to blue and green, reflecting light from the sky. The sky itself ranges from clear blue to cloudy, with some images capturing serene sunset or sunrise moments with warm hues. Shores, beaches, or rocky structures may be present but are not the focal point, adding context to the expansive water view.",
  "shark": "The class 'shark' typically appears as a large, elongated fish with a pointed snout and a streamlined body, often gray or brown in color, featuring a dorsal fin and a tail with a distinctive caudal fin, although the provided images are too blurry to discern detailed characteristics.",
  "television": "The typical appearance of a television is a rectangular device with a flat screen and a black border, often with a slightly curved screen in older models. The screen displays vibrant colors and images, which can range from people, objects, and scenery to text and graphics. The TVs may vary in size, with some appearing larger than others. Despite the blurriness of the images, they consistently show a screen with a black frame and colorful content, giving a general idea of what a television looks like.",
  "tractor": "The class 'tractor' typically appears as a large, heavy-duty vehicle with a prominent front end featuring a blade or bucket. The images provided show mostly yellow but sometimes red tractors or construction equipment with tracks or large tires. A characteristic feature includes a raised cabin and an arm or boom. Despite the blurriness of the images, common attributes visible across them are a rugged design for heavy-duty tasks.",
  "baby": "The class 'baby' is characterized by images featuring young children, typically under the age of one or two, with chubby cheeks, soft facial features, and a generally rounded appearance. Their hair is often thin and short, and their facial expressions are frequently neutral or smiley. The infants are often dressed in casual clothing such as t-shirts, and some may be wearing accessories like hats.",
  "bed": "The class 'bed' typically features a mattress on a frame, often accompanied by a headboard and sometimes a footboard. The frames can be made from various materials such as wood or metal and come in different styles, including bunk beds and platform beds. Beds may have one or more pillows and can be covered with sheets, blankets, or comforters in a variety of colors and patterns. The images show beds in different settings and orientations, with varying frame styles and colors.",
  "bicycle": "The bicycle class typically features a frame with two wheels of roughly equal size connected by a down tube, seat post, and handlebars. A seat and pedals are consistently present. Wheels are usually circular with spokes. Frames vary in color and material, from metallic tones to vibrant hues. The composition often highlights the bike's structure against natural or man-made backgrounds.",
  "chimpanzee": "The typical chimpanzee has a sturdy build with dark brown to black fur covering its body, although some images show lighter patches on the face and ears. The face is relatively flat with a prominent forehead, and the eyes are dark. The nose is broad and flat, and the mouth is small. The ears are relatively small and rounded. Chimpanzees appear muscular, particularly in the arms and shoulders, and often sit or stand with a slightly hunched posture.",
  "fox": "The class 'fox' typically appears as a medium-sized canine with a slender body, orange-brown fur, and a white underside to its face. The fur on their back and sides often appears darker, with hints of brown and black. Their ears are pointed, and their bushy tails are long. The images show variations in posture and surroundings.",
  "leopard": "The class 'leopard' typically appears as a medium-sized, carnivorous feline with a golden to dark yellow coat featuring distinctive black spots or rosettes, a white underbelly, and a long tail; the images suggest a slender yet muscular build, with a head shape that is broad and rounded, and ears that are small and rounded, though image quality issues obscure finer details.",
  "man": "The class 'man' typically appears as a figure with a humanoid form, often depicted with short hair and a variety of facial features. He may have a range of expressions and postures, from standing shirtless to sitting or standing with a blurred face. His attire varies, including casual and formal wear such as shirts, ties, and jackets. Facial hair and balding are also possible characteristics. Overall, the appearance of a man can be quite diverse, but these images suggest a generally humanoid form with varied expressions and attire.",
  "pickup_truck": "The pickup_truck class typically features a vehicle with a cargo bed behind the cabin and a distinct rear end. The truck's body is often rectangular with a flat hood and a cab that can vary in size. The images show trucks in various colors, including red, white, black, and green, with some having a more vintage appearance and others appearing more modern. The trucks have four wheels and a prominent front grille.",
  "plain": "The class 'plain' is characterized by images that are heavily blurred, obscuring most details. However, based on the visible elements, the typical appearance includes a vast, open area, likely a field or grassland, with a clear horizon line separating the land from the sky. The sky occupies a significant portion of the images, often featuring clouds and a range of colors, from blue to purple and pink, suggesting various times of day. The overall effect is one of softness and ambiguity, with no sharp features or defined objects.",
  "poppy": "The class 'poppy' typically features flowers with delicate, papery petals and a prominent center. The most common color appears to be a vibrant red, as seen in four out of the five images, with one image showing a white flower with an orange center. The poppies have a slender stem and are often depicted growing in a field or garden setting, surrounded by greenery.",
  "rocket": "The class 'rocket' typically appears as a long, slender, cylindrical object with a pointed tip, often with a rounded or conical base, and usually featuring fins or stabilizers at the rear; it may emit flames and smoke during launch or propulsion, and can be depicted in various settings, including on a launchpad, in flight, or amidst explosions of fire and smoke, with colors ranging from metallic to bright red, orange, and yellow.",
  "rose": "The class 'rose' typically features flowers with lush, layered petals and a predominantly rounded shape. The blooms come in a variety of vibrant colors, including yellow, pink, red, and peach. The images show that roses often have green leaves and stems, and they can appear in both close-up views and as part of a larger bush or arrangement. Despite the blurriness of the images, the characteristic fullness and colorful petals of roses are consistently visible.",
  "snail": "The typical appearance of a snail is characterized by a rounded, spiral shell that varies in color from white to gold to brown. The shell often features stripes or swirling patterns in shades of brown, yellow, or gray. The body of the snail is soft and slimy, usually a pale shade, and is often not fully visible due to its retracted position within the shell. The overall appearance is rounded and smooth, with the shell serving as the most prominent visual feature.",
  "sweet_pepper": "The sweet pepper class is characterized by its typically blocky, glossy appearance, often with a green stem attached. They are usually bell-shaped with three to four lobes, and their color can vary, commonly being red, orange, or sometimes green, with a smooth, slightly ribbed skin.",
  "table": "The class 'table' typically features a flat surface, often rectangular or circular, supported by legs or a base. The images show tables with varying materials, such as dark wood, light wood, and possibly metal, and different styles, including simple and ornate designs. Some tables appear to have a smooth, flat top, while others have a more decorative edge. The legs of the tables are often slender and tapered, and may be straight or curved. Overall, the tables in this class share a common function as a piece of furniture for holding objects, but exhibit a range of visual characteristics.",
  "telephone": "The class 'telephone' typically appears as a handheld or desktop device with a keypad or touchscreen interface. It often features a rounded rectangular shape with a flat front and a protruding section for the earpiece or screen. The devices can vary in color, with examples including white, blue, pink, and black, and may have additional features such as a numeric keypad, antenna, or display screen. Overall, telephones tend to have a compact, portable design with a focus on functionality and user interface.",
  "wardrobe": "The 'wardrobe' class typically appears as a tall, rectangular piece of furniture with a wooden finish, often light brown in color. It usually has doors, which may be single or double, and sometimes features decorative elements such as handles or arched panels. The wardrobe often has a flat top and a base, and may be positioned against a wall, with some images suggesting a simple, traditional design.",
  "whale": "The class 'whale' exhibits a diverse range of visual characteristics. However, typical features include a streamlined body, often dark-colored with possible white markings; a prominent dorsal fin; and a large, rounded head. The body shape varies from slender to robust, with a tapering tail. The images depict whales with predominantly dark hues, some with white accents, and varying body shapes, but all share a marine mammal appearance with a horizontal tail and a blowhole on top of the head, though not clearly visible in all images.",
  "woman": "The class 'woman' typically appears as a female figure with variations in skin tone, hair color, and style. Her hair can be short, long, dark, or light brown, and she often wears casual to semi-casual clothing such as t-shirts, sweaters, or jackets. The women's facial features and expressions vary, but they generally have a feminine appearance. The images are often blurry, making it difficult to discern specific details, but the overall appearance suggests a range of ages and ethnicities.",
  "worm": "The class 'worm' typically appears as elongated, curved, and slender creatures with smooth bodies; their colors vary, ranging from light brown, beige, to darker shades, and some display a subtle gradient or uniform tone; they lack distinct features such as legs or prominent eyes, and their bodies are generally uniform in width, tapering slightly at one or both ends."
}