{
  "apple": "The class 'apple' typically consists of rounded objects with a short stem attached to the top. They are usually globular in shape and have a smooth skin that can range in color from green, yellow, orange, to red; some apples have a shiny appearance while others appear more matte.",
  "aquarium_fish": "The typical appearance of an aquarium fish includes a variety of colors such as red, orange, yellow, white, and black. They have a generally oval body shape with scales that can be solid-colored or patterned with stripes. Their fins and tails vary in shape and size, and some have distinctive markings on their heads or bodies. Overall, the images suggest that aquarium fish have a diverse range of appearances.",
  "bear": "The typical appearance of a bear in this class is characterized by a stout body, short snout, and a generally dark-colored coat, ranging from light brown to black, with some possibly having a distinctive light-colored marking on their snout or face; their fur appears thick and coarse, and their posture varies from standing on two legs to bending down.",
  "bee": "The class 'bee' is characterized by a fuzzy, yellow and black body with visible wings. The images depict the insects with their heads often obscured, bodies covered in a yellow and brown fuzz, and a distinctive black and yellow pattern on their thorax. The wings are typically transparent or light-colored, and the overall appearance is fuzzy due to the blurriness of the images.",
  "bottle": "The typical appearance of a bottle is a slender, elongated container with a narrow neck and a wider body, often with a distinct shoulder where the neck meets the body. Bottles come in various colors, including transparent, brown, green, and white, and may feature labels or caps; they are commonly positioned upright.",
  "bowl": "The class 'bowl' typically features a rounded, hollow shape with an open top and no handles or one or more handles, often made of ceramic, glass, or other materials. Various colors and patterns are present, ranging from solid to multicolored. The bowls appear to be filled with various food items or are empty. The images suggest a common tableware item used for serving or consuming food.",
  "boy": "The class 'boy' typically appears as a young male child with short hair, often wearing casual clothing such as t-shirts, hoodies, or no shirt at all. Facial expressions vary, but many have a neutral or happy demeanor. Their ages appear to range from early to late childhood.",
  "bridge": "The class 'bridge' typically features a structure spanning over water or land, often with a curved or arched top and a flat surface. The images show bridges with varying designs, including those with pillars and those that are more solid, but all share the commonality of crossing over a body of water or a pathway, with a clear distinction between the bridge itself and the surrounding environment.",
  "bus": "The class 'bus' typically appears as a large, elongated vehicle with a rounded roof and multiple windows along its side. The color varies, but common colors include yellow, blue, white, and red, and some buses are painted with various multicolored patterns. A bus usually has a prominent front end with a windshield and may feature doors and vents on its side and top.",
  "can": "The class 'can' typically features cylindrical containers made of metal, often with a rounded body and flat top and bottom. They usually have a label or design on the side, which can vary in color, pattern, and text; some have a pull tab or lid.",
  "castle": "The class 'castle' typically features a large, imposing structure with towers, often made of stone or brick, and may have distinctive architectural elements such as battlements, turrets, or spires; the buildings can vary in color but are commonly depicted in shades of brown, beige, or gray, set against a backdrop of greenery or a blue sky.",
  "caterpillar": "The caterpillar class is characterized by elongated, worm-like bodies with varied coloration, including shades of brown, yellow, and green, often featuring distinctive markings or patterns; they tend to have a fuzzy or textured appearance.",
  "chair": "The typical appearance of a chair includes a backrest and a seat, supported by legs or a frame. Chairs come in various styles, from simple, minimalist designs with metal frames and fabric or mesh seating, to more traditional, ornate styles with wooden frames and upholstered seats, often featuring four legs or a base for stability.",
  "clock": "The class 'clock' typically appears as a device with a circular or rounded rectangular face displaying numerical or analog time representations. The faces can be digital with numeric displays, or analog with hour and minute hands, and sometimes feature additional details such as a date or alarm functions. The designs vary widely, from simple and minimalist to decorative and elaborate, with colors ranging from monochromatic to vibrant and multicolored, and may include backgrounds or borders that enhance their visual appeal.",
  "cloud": "The class 'cloud' typically appears as a blue sky with white, puffy, and soft-textured cloud formations. The clouds vary in shape and size, ranging from thin wisps to larger, more defined masses, often with subtle gradations of white and light blue hues. The overall effect is one of softness and blurriness, with the clouds blending gently into the sky.",
  "cockroach": "The class 'cockroach' is characterized by a flat, oval body with a shiny exoskeleton that ranges in color from brown to black, often with a distinctive sheen. They have six legs, two long antennae, and a lack of wings or with rudimentary wings. The body size and coloration can vary but generally, they have a dark, somewhat uniform coloration with or without lighter markings on their back or sides. Their legs are thin and appear fragile compared to their body.",
  "couch": "The couch class typically appears as a piece of furniture with a sturdy base, a cushioned seat and backrest, and armrests on either side. It can vary in color, material, and design, but often features a rectangular or curved shape with a flat or sloping back, and may be upholstered in fabric or leather, as seen in the diverse range of blurry images provided, which showcase different colors, textures, and settings.",
  "cup": "The typical appearance of a cup includes a rounded or cylindrical body, often with a base that allows it to stand upright, and may feature handles on either side; they can be made of various materials, such as metal, giving them a shiny appearance, and may have decorative elements like engravings, crosses, or colorful designs, all presented in a generally symmetrical form.",
  "dinosaur": "The class 'dinosaur' typically appears as a large, four-legged or bipedal creature with a long tail, often accompanied by distinctive features such as spikes or a crest. Their bodies are generally bulky, with varying shades of brown and red hues. Some have prominent heads, while others have elongated necks and tails, but all share a rugged, prehistoric appearance.",
  "dolphin": "The typical appearance of a dolphin is characterized by a streamlined body, usually gray or dark gray on top with a lighter-colored belly, often white or beige. A distinctive dorsal fin is present on their back, and their snout is long and pointed. The body tapers towards the tail, which is not visible in these images but is known to be a horizontal fluke. The overall sleek and torpedo-shaped form is well-suited for their aquatic environment.",
  "elephant": "The class 'elephant' typically appears as a large, robust animal with a brownish-gray skin tone, ranging from light brown to dark gray. They have a distinctive body shape, characterized by a large head, a long curved tusk, and a trunk that is long and flexible. The legs are thick and pillar-like, supporting the massive body, while the ears are large. Despite the images being blurry, the overall appearance of the elephants is consistent, with a focus on their size, body shape, and distinctive features.",
  "forest": "The class 'forest' typically appears as a green-dominated scene with blurry tree trunks and foliage. The colors range from dark to light green, with occasional hints of brown, yellow, and gray. The images are characteristically blurry, with dense vegetation obscuring clear details. The overall effect is a soft focus on a natural, wooded environment with an emphasis on greens.",
  "girl": "The class 'girl' typically appears as a young female with a smiling face, wearing casual attire such as t-shirts, hats, and overalls. Her hair is often cut in a bob or shoulder-length style, and comes in various shades of brown and blonde. The images suggest a youthful and vibrant appearance, with a focus on relaxed and everyday clothing.",
  "hamster": "The hamster class typically appears as a small, rounded creature with a compact body, short legs, and erect ears. They have large eyes and a small pink nose. Their fur varies in color, but common shades include light to dark brown, tan, and white, often with distinctive markings on their face and body, and some have a white patch on their forehead or a dark stripe on their back.",
  "house": "The typical appearance of a house in this class is characterized by a white or light-colored exterior, a sloping roof, and a garage. The houses appear to have a traditional suburban style, with a focus on simplicity and functionality. They often have a small front yard with trees and bushes, and a driveway leading up to the garage. The images are blurry, but they suggest a cozy and inviting atmosphere, with an emphasis on clean lines and minimal ornamentation. Overall, the houses in this class appear to be classic, one- or two-story residential buildings with a straightforward design.",
  "kangaroo": "The kangaroo class is characterized by a distinctive appearance, featuring a stout body covered in thick fur that ranges in color from brown to gray, often with a white underbelly. Their ears are typically rounded and erect, while their strong back legs and tail are well-suited for hopping. The fur can vary in shade, but generally, they have a brownish-gray coat with a white chest and belly. Their facial features include a small nose and dark eyes, set within a rounded head. The overall build is muscular, particularly in the hindquarters, reflecting their iconic method of movement.",
  "keyboard": "The typical appearance of a keyboard is a flat, rectangular device with a grid of keys, often featuring a standard QWERTY layout. Keyboards can vary in color, with examples including dark brown and black keys, white or silver keyboards, and may have distinct features such as a curved or angled design; their keys may be rectangular with rounded edges and feature white or light-colored markings.",
  "lawn_mower": "The typical appearance of a lawn mower in this class is characterized by a compact body with a handlebar attached, usually having two or more wheels, and a cutting mechanism, often with a predominantly bright color scheme including shades of orange, yellow, and red, accompanied by black and sometimes green accents.",
  "lion": "The class 'lion' is characterized by a distinctive appearance, featuring a predominantly golden or tawny coat with a shaggy mane that frames the head and neck, a short, broad head with a short snout, and a tuft of hair at the end of the tail; lions typically have a muscular build with a prominent jaw and a short, tawny or dark-colored mane that varies in color from a light golden to dark brown.",
  "lizard": "The class 'lizard' typically appears as a small to medium-sized reptile with a elongated body, long tail. They have scales that vary in coloration across species. Their heads are generally small compared to their body. Limbs are present, positioned on either side of the body. The overall appearance varies in terms of color, pattern, and size, but these features are generally consistent across the class.",
  "lobster": "The class 'lobster' appears to be characterized by a predominantly orange or brown coloration, with some variations in shade. The creatures have a distinctive elongated body shape with a large, prominent head or cephalothorax and a long tail. They also feature large claws or pincers, which are often held forward. The images suggest that lobsters have multiple limbs and a segmented body, although the exact details are difficult to discern due to the blurry quality of the images. Overall, the typical appearance of a lobster seems to be that of a crustacean with a bold, colorful appearance and a distinctive morphology.",
  "mountain": "The class 'mountain' typically appears as a large, elevated landform with a rugged and rocky appearance, often with a peak or summit that rises prominently into the sky; the images show mountains with varying levels of snow cover, set against a clear blue sky and sometimes accompanied by trees, grass, or water in the foreground, with the mountains often depicted in the distance, showcasing their grandeur and majesty.",
  "mouse": "The class 'mouse' appears to be small, furry rodents with rounded bodies, although the blurry images obscure finer details. They seem to have dark or brown-colored fur, with some possibly having lighter patches on their faces or feet. Their sizes and postures vary, with some curled up or sitting on objects, but overall, they share a compact, tiny appearance.",
  "mushroom": "The typical appearance of the class 'mushroom' includes a rounded or teardrop-shaped cap with a range of earthy tones such as brown, orange, and red, often paired with a white stem; some mushrooms have short, stubby stems while others have longer, more slender ones; the caps vary in color intensity and the stems may exhibit subtle details like patches or rings, but overall, they share a natural, earthy aesthetic.",
  "oak_tree": "The oak tree class typically appears as a large, sprawling tree with a broad canopy and a thick trunk. The foliage is generally green, although it may appear more yellowish or brownish in certain lighting conditions. The trees are often situated in grassy areas, with a clear sky visible above, and their blurry appearance suggests a distant or low-resolution capture. Overall, the oak trees have a robust and expansive presence.",
  "orange": "The typical appearance of the class 'orange' is characterized by a spherical shape, vibrant orange color, and a smooth skin. The oranges are often depicted in various arrangements, including whole and sliced, showcasing their juicy pulp and white or light-colored centers. The images display a range of orange hues, from light to dark, with some featuring a slight sheen or reflections, indicating a fresh and possibly glossy texture.",
  "orchid": "The class 'orchid' is characterized by flowers with three petals and three sepals, often resembling a distinctive lip or labellum; they exhibit a range of vibrant colors, including pink, purple, orange, and yellow; the blooms vary in size and are frequently accompanied by lush, green leaves; overall, orchids display a unique, exotic appearance with notable diversity in coloration and form.",
  "palm_tree": "The class 'palm_tree' typically appears as a tall, slender tree with a straight trunk and a crown of long, thin leaves that radiate from the top. The leaves are usually green and feathery, although the images are blurry. The trees are often set against a blue sky with white clouds, and may be surrounded by buildings or other structures, and vary in distance, orientation and size.",
  "pear": "The typical appearance of a pear is characterized by its elongated, teardrop shape with a narrow stem end and a rounded base. The skin appears smooth, with a yellowish-green color, although some pears may exhibit a reddish tint on their skin. The fruit's surface is often slightly blurry in appearance due to its natural texture, and its stem is usually small and attached to the top. Overall, the pear's shape and coloration are distinctive, making it easily recognizable.",
  "pine_tree": "The class 'pine_tree' typically appears as a tree with a slender trunk and a conical or irregularly-shaped crown, featuring needle-like leaves that are usually green in color. The images suggest that pine trees often have a rugged texture and may exhibit variations in foliage density and color, ranging from light green to darker shades, with some trees displaying a more vibrant tone against a clear blue sky with or without clouds.",
  "plate": "The class 'plate' typically consists of a circular, flat dish with a wide rim and a central area that may feature various designs, patterns, or images. The plates appear to have a raised edge and a smooth, rounded body, with colors and designs varying across different plates, including solid colors, illustrations, and patterns; some have decorative elements such as lines, shapes, or figures.",
  "porcupine": "The porcupine class is characterized by a compact, rounded body covered with quills or spines, although the images provided are blurry. The quills appear to vary in color, ranging from dark brown to light tan, and are often interspersed with lighter-colored fur. The facial features are not clearly discernible due to the image quality; however, the overall body shape and quill coverage are consistent across the examples, suggesting a stocky build with a short tail and legs, typical of porcupines.",
  "possum": "The typical appearance of a possum is characterized by a stocky body, often gray or brown in color, with a pointed snout and large, rounded eyes. Their fur appears thick and can have a white or cream-colored face and underside, with a bushy tail that is often prehensile, allowing them to grasp and climb. The images suggest a compact build, with possums frequently sitting upright or perched, showcasing their adaptable and nimble nature.",
  "rabbit": "The typical appearance of a rabbit includes a compact body with long ears, and a varying coat color that can range from white, brown, to a mix of both; their fur appears soft and fluffy. Although image quality is poor, rabbits seem to have relatively short legs and a small tail. Overall, rabbits have a distinctive and endearing appearance.",
  "raccoon": "The typical appearance of a raccoon is characterized by a distinctive black and white facial mask-like pattern around its eyes, a grayish-brown coat with a bushy tail featuring a mix of black, white, and brown rings. The fur appears thick and coarse, with a stout body and short legs. The coloration varies from dark brown to light gray, but the characteristic facial markings and ringed tail are consistent across the images.",
  "ray": "The class 'ray' typically appears as a flat, disk-shaped body with a long tail, often featuring a distinctive shape with fins or pectoral fins that resemble wings. The body can vary in color, ranging from white, yellow, and blue to dark brown or black, and may have markings or spots. The overall shape is usually rounded or angular, with a tail that extends from the body, sometimes with a barb or stinger visible. The rays appear to have a smooth, sleek appearance, with a subtle sheen.",
  "road": "The typical appearance of the 'road' class includes a gray or light-colored pathway stretching into the distance, often with white or yellow markings, set against a backdrop of natural scenery such as blue skies, hills, trees, and grassy areas, with varying levels of blurriness and lighting effects.",
  "seal": "The typical appearance of a seal is characterized by a streamlined body, often with a mix of dark and light colors ranging from gray to brown. They have a distinctive head shape with a short snout and large eyes that are usually dark. Their flippers are prominent, and their body tapers to a tail-like fluke, although it is not always visible. The images show variability in color and positioning, but overall, seals have a robust yet sleek appearance adapted for aquatic life.",
  "shrew": "The class 'shrew' typically appears as a small, compact animal with a pointed snout and a rounded body. The fur color varies, but common colors include brown, black, and white, with some species having distinctive stripes or white markings on their face and belly. Overall, shrews have a stout body, short legs, and a long, narrow snout, giving them a distinctive, mouse-like appearance with some notable variations in coloration.",
  "skunk": "The typical appearance of a skunk is characterized by a predominantly black body with a distinctive white stripe or patch, often running along its back or shoulders. The white marking may also be present on the skunk's forehead, face, or tail. The images suggest that skunks have a stout body and short legs, although the blurry quality of the images makes it difficult to discern further details. Overall, the black and white coloration is a striking feature of this class.",
  "skyscraper": "The skyscraper class typically features tall, imposing structures often with a rectangular or tapered shape, rising high into the sky. They are usually depicted against a clear blue sky or with sun glare, showcasing their towering presence. The buildings may appear in various shades, from dark and sleek to light and reflective, with some images capturing their full height and others focusing on their imposing facades.",
  "snake": "The class 'snake' typically appears as a long, slender, and elongated creature with a smooth body, often featuring a range of colors and patterns such as solids, stripes, or blotches, and may display various textures, with some exhibiting distinctive markings or coloration on their heads, bodies, or tails, and commonly have a winding or curved shape.",
  "spider": "The class 'spider' typically appears as a small, multi-legged creature with a rounded body and eight legs, often featuring a distinct coloration pattern. The body and legs display a range of colors including black, white, orange, red, and yellow, with some specimens having bold markings or stripes; however, the exact coloration and pattern can vary significantly between individuals.",
  "squirrel": "The typical appearance of a squirrel is characterized by a small to medium-sized body covered in soft fur, which ranges in color from gray to brown with white underparts. The ears are pointed and erect, and the tail is long and bushy, often carried with a distinctive flicking motion; although the provided images are blurry, they consistently show these features.",
  "streetcar": "The class 'streetcar' typically appears as a long, enclosed vehicle with a flat roof and a distinctive rectangular shape. They often have a bold, bright color scheme, with a red and white color combination being particularly common, although other colors like green and orange are also present. The streetcars usually have multiple windows along their sides and a prominent front end with a windshield. While the images are blurry, they consistently show a vehicle with a classic, urban transit design.",
  "sunflower": "The class 'sunflower' typically appears as a large, bright yellow flower with a dark center, surrounded by numerous long, thin petals that radiate from the center. The petals are usually a vibrant yellow color, while the center is dark brown or black, and the overall appearance is often slightly blurry.",
  "tank": "The class 'tank' typically appears as a large, armored vehicle with a prominent cannon or gun protruding from a rotating turret on top. Characterized by its tracked base, the tank's body is generally low and wide, with a flat or sloping surface, and often features a dark color scheme, frequently camouflaged in shades of green, brown, or grey.",
  "tiger": "The class 'tiger' typically appears as a large cat with orange and brown fur, featuring black stripes. The head is rounded, with a short snout and small, rounded ears. The eyes are yellow or golden, and the body is muscular with a long tail. The facial markings include a white patch on the forehead, and the fur has a distinctive striped pattern. Overall, tigers have a powerful and majestic appearance.",
  "train": "The class 'train' typically appears as a long, multi-carriage vehicle with a rounded or angular front end, often featuring a bold color scheme and distinctive stripes or logos. The trains vary in color, including silver with red stripes, green, red and yellow, and red and white, but commonly have a metallic sheen and are situated on tracks, surrounded by natural environments like grass and trees or urban settings like platforms.",
  "trout": "The class 'trout' typically appears as an elongated, streamlined fish with a generally brown or multi-tonal coloration, featuring various shades of pink, white, and darker hues on its body, sides, and fins; the body often displays distinctive markings and a white or yellowish belly, while the fins range in color from orange to red and white.",
  "tulip": "The class 'tulip' visually appears as a bulbous flower with a cup-shaped bloom, typically having three petals and three sepals, although the provided images are blurry. The flowers are commonly vibrant in color, often displaying shades of red, pink, yellow, and orange; they have slender stems and are frequently depicted against a backdrop of green foliage.",
  "turtle": "The class 'turtle' appears to be characterized by a streamlined body covered in a shell, with a head and flippers. The images show variations in coloration, ranging from greenish-brown to white and yellowish hues, but all feature a distinctive shell that sets them apart. The shell often appears as a dome-shaped structure on their back.",
  "willow_tree": "The class 'willow_tree' appears to be characterized by blurry, out-of-focus images of trees or shrubs with a predominantly green color palette. The foliage seems to be dense and leafy with a lack of clear definition due to the blurriness. Overall, the images suggest a natural, possibly garden or park-like setting.",
  "wolf": "The typical appearance of a wolf is characterized by a combination of brown, gray, and white hues in their fur, with variations in shading and tone across the body. They have pointy ears that stand erect, a broad head with a relatively long snout, and a robust build. The facial features include dark eyes and a black nose. The images show wolves with thicker fur around the neck and chest areas, giving them a distinctive appearance. Despite the blurriness of the images, these characteristics consistently define the class 'wolf'.",
  "beaver": "The class 'beaver' appears to be characterized by a stocky, brown body with a rounded head and dark fur. The images suggest that they have a distinctive hunch-like posture, with their bodies often positioned close to the ground or water. Their fur seems to range from dark brown to light brown, and may have variations in texture and tone across their body. The images are blurry, but overall, the beaver appears to be a stout, brown-furred animal with a unique posture.",
  "beetle": "The typical appearance of a beetle is characterized by a compact, oval body that is usually dark-colored, ranging from black to shades of green and brown. The body appears sturdy and often shiny, with some species displaying vibrant colors and patterns. Beetles seem to have short, visible legs and antennae. Their bodies are generally small to medium-sized, and the images suggest a hard exoskeleton. Overall, the beetles in these images appear to be relatively small, rounded insects with a distinctive body shape.",
  "butterfly": "The class 'butterfly' visually appears to have a range of vibrant colors and patterns. They have two prominent wings, often with distinctive markings, which can be orange, blue, yellow, or brown, sometimes featuring darker lines or borders. The wings are typically large in proportion to their body and are displayed prominently, even when at rest. The images suggest that butterflies also often interact with flowers, are found in outdoor, natural settings like gardens or grassy areas.",
  "camel": "The class 'camel' typically appears as a large, even-toed ungulate with a distinctive elongated neck, long legs, and a hump on its back. The camel's coat is usually a sandy-brown color, which helps it blend in with its desert habitat. Its head is relatively small compared to its body, with a pair of eyes and a mouth. The images depict the camel standing or sitting in various environments.",
  "cattle": "The cattle class exhibits a diverse range of coat colors and patterns, including solid black, white, brown, and combinations of these colors with white markings. They generally have a sturdy build and four legs, with some featuring horns. Their head shapes and sizes vary, but most have a distinctive muzzle and ears. The images suggest that cattle come in various sizes, with some appearing more muscular or larger than others. Overall, the typical appearance of cattle is characterized by their robust body, variable coat coloration, and presence of distinctive facial features.",
  "crab": "The class 'crab' typically appears as a crustacean with a broad, flat body and eight long, thin legs, often featuring vibrant colors and patterns such as orange, yellow, red, and white, with some specimens displaying distinctive markings or banding on their legs and claws; their bodies can range from pale pink to dark brown, and are usually positioned with their legs splayed outwards.",
  "crocodile": "The class 'crocodile' typically appears as a large, elongated reptile with a long, rounded snout. The body is generally gray or greenish in color, with variations including pinkish or white undertones. The tail is long and tapering, and the overall body shape is robust, with visible limbs, although the images are blurry.",
  "flatfish": "The class 'flatfish' typically appears as a flat, oval-shaped body with a broad head and a long, pointed snout. The coloration varies, with some individuals displaying a white or light-colored belly and brown or mottled upper side. The size and shape of the fish can differ; however, they generally have a flattened appearance with both eyes on one side of the head, often on the right side and usually brown on the top, white on the bottom or vice versa.",
  "lamp": "The class 'lamp' typically appears as a lighting fixture with a base, stem, and shade; it can vary in shape and size, but often features a slender stem supporting a rounded or conical shade that emits light. The base provides stability and can be simple or ornate. Lamps may have a switch or other adjustable features.",
  "maple_tree": "The maple tree class is characterized by a medium to large-sized tree with a broad, rounded crown and a straight trunk. Its foliage appears as a lush green canopy in spring and summer, transitioning to vibrant shades of orange, yellow, and red in autumn, as seen in the images. The trees are depicted as being situated in grassy areas, with some images featuring blurred backgrounds that suggest urban or park-like settings. Overall, the maple trees in this class exhibit a classic deciduous tree appearance with seasonal changes in leaf color.",
  "motorcycle": "The typical motorcycle appears to have two wheels, a seat for the rider, and a handlebar with a windshield or screen. The body style varies, but often features a fuel tank, and may have saddlebags attached. Colors range from bold hues like purple and blue to more subdued tones like black and silver.",
  "otter": "The class 'otter' appears to be characterized by a sleek and elongated body, often with a dark brown or black coat. The head is typically rounded with a short snout, wet fur, and the eyes not always visible. The images suggest a semi-aquatic lifestyle, with some photos showing the animal in or near water. Overall, otters seem to have a streamlined appearance well-suited to their aquatic environment with brown color variations.",
  "sea": "The class 'sea' is characterized by blurry and hazy images featuring expansive bodies of water. The images often depict serene and peaceful scenes, with soft, diffused light. Water dominates the foreground, while the horizon line and sky are visible in the background. The color palette is typically muted, with shades of blue, grey, and orange, often with a warm glow during sunrise or sunset. The overall effect is one of softness and tranquility, with no sharp details or defined features.",
  "shark": "The class 'shark' typically appears as a streamlined, elongated fish with a pointed snout and a prominent dorsal fin. Their bodies are often gray or white on the belly and darker on the back, with varying shades of coloration; some have distinctive markings or color patterns. The mouth is usually positioned on the underside of the head, featuring rows of sharp teeth, and the tail is often visible, sometimes with a distinctive shape. Overall, sharks have a torpedo-shaped body with a horizontal tail and fins along their sides.",
  "television": "The typical appearance of a television is characterized by a rectangular screen, often accompanied by a separate box or console, and sometimes a remote control. The devices vary in color, with examples including white, gray, brown, and black, and may feature additional elements such as buttons, antennae, or a wooden casing, showcasing a range of designs from old to modern styles.",
  "tractor": "The typical appearance of a tractor in these images is characterized by a predominantly yellow color scheme, with a large metal blade or bucket at the front, and a cabin or operator's seat at the top. The tractors appear to have tracks or large wheels for mobility, and some feature additional attachments or components such as exhaust pipes. They tend to have a rugged, industrial design with a focus on functionality.",
  "baby": "The class 'baby' typically features images of young children characterized by their chubby cheeks, soft facial features, and blurry, often out-of-focus appearance. The babies have light skin tones, with some having blonde or dark hair. Their clothing varies, with some wearing casual outfits like onesies and bibs, while others appear to be naked or partially clothed. The backgrounds are often indistinct and colorful, ranging from natural settings like grass to indoor environments. Overall, the images convey a sense of innocence and youth.",
  "bed": "The class 'bed' typically features a central piece of furniture with a flat surface covered by bedding, often accompanied by a headboard and footboard. Beds are commonly adorned with mattresses, sheets, blankets, or comforters. These beds are frequently paired with complementary nightstands, dressers, and lamps, and are situated against a wall within a room with varying color schemes, as depicted by the diverse backgrounds and beddings across the images.",
  "bicycle": "The bicycle class typically appears as a vehicle with two wheels, a frame, and handlebars. The images show variations in color, size, and style, but common features include a seat, pedals, and a structure connecting the wheels. The bicycles may have different numbers of gears, wheel sizes, and frame designs, but the core elements of two wheels and a central frame are consistent across the examples.",
  "chimpanzee": "The typical appearance of a chimpanzee is characterized by a stout body covered in dark brown to black fur, a flat face with a prominent forehead, and a distinctive facial structure featuring a light-colored face with a pinkish-colored skin around the nose and mouth. The eyes are dark, and the ears are relatively small. The limbs are long and strong, with hands and feet adapted for climbing and grasping. The overall build is muscular, with a prominent torso and strong arms, as seen in the various poses captured in the images, from sitting and standing to hanging from branches.",
  "fox": "The typical appearance of the class 'fox' includes a slender body covered in fur, with a range of colors from white to orange. The white fur can be seen on their face, while orange fur is common on their body. Additionally, their legs and tail often display a striking black coloration. Their ears are pointy and alert. The images suggest a generally agile and alert demeanor.",
  "leopard": "The leopard class is characterized by a distinctive appearance featuring a predominantly golden to light-brown coat adorned with dark spots or rosettes. The body is sleek and muscular, with a long tail and legs that appear powerful. The facial features include a short, broad head with a white chin and a pinkish nose. A notable characteristic is the presence of dark spots or patches on the face, contrasting with the lighter background color. Overall, the leopards in these images exhibit a striking combination of golden and dark hues, with a robust yet agile physique.",
  "man": "The class 'man' typically appears as a figure with a humanoid form and facial features, often with variations in age, expression, and attire; images show men with different hairstyles, some with beards or mustaches, wearing casual or formal clothing, including hoodies, t-shirts, suits, and ties, set against blurred backgrounds that range from outdoor settings to indoor environments.",
  "pickup_truck": "The typical appearance of a pickup truck in this class is characterized by a boxy body style, a flat bed in the rear, and a cab with two front doors and a distinct front grille. The trucks appear to have a rugged and utilitarian design, with a range of colors including white, red, and gray. They are often depicted in outdoor settings, such as on roads or in grassy areas, and may feature additional details like side steps or running boards. Overall, the pickup trucks in this class have a sturdy and functional appearance.",
  "plain": "The class 'plain' is characterized by blurry and out-of-focus images of expansive, open areas. The dominant features are vast fields or grasslands that stretch to the horizon, often with a clear sky above featuring clouds. The colors are typically muted, with shades of green, yellow, brown, and blue, and may include warm tones from sunrise or sunset. While some images appear to have distant structures, they are indistinct. Overall, the images convey a sense of vastness and serenity.",
  "poppy": "The class 'poppy' typically appears as a vibrant, cup-shaped flower with delicate, papery petals that range in color from bright oranges to deep reds, often with a yellow center. The petals may be solid or gradient-colored, and the centers are usually a bright yellow or greenish-yellow. The images suggest a soft, delicate texture, and the overall appearance is one of subtle, gentle beauty.",
  "rocket": "The class 'rocket' typically appears as a tall, slender structure with a pointed top and cylindrical body, often with visible sections or segments. The color scheme usually features a metallic or white hue, sometimes accompanied by darker sections or details. The rockets are frequently depicted against a sky background, with some images capturing them on the ground while others show them in mid-launch, emitting bright lights or flames. Despite varying angles and lighting conditions, the rockets' elongated shape and tapering form are consistently prominent.",
  "rose": "The class 'rose' typically appears as a flower with multiple rounded or pointed petals that are often layered, showcasing a range of vibrant colors including yellow, orange, pink, and red, with some images featuring green leaves and stems, and backgrounds varying from dark to light.",
  "snail": "The typical appearance of a snail is characterized by a rounded, spiral shell that varies in color, often featuring shades of brown, yellow, and white. The shell appears smooth with visible spiral ridges. A slimy foot protrudes from the shell, which is usually not clearly visible in images due to blurriness. Snails seem to have a small head with antennae-like features. The overall appearance is rounded and bulbous due to the prominent shell.",
  "sweet_pepper": "The sweet pepper class is characterized by bell-shaped fruits, typically with a glossy appearance, and come in a variety of colors, predominantly green and red. They have a distinctive stem attached at the top and a smooth, slightly ribbed texture. The peppers vary in size but are generally compact and blocky.",
  "table": "The typical appearance of a table includes a flat surface that is usually a rectangle or a circle, and is supported by one or more legs typically made of wood or metal. Overall, the images are blurry but they all depict a piece of furniture with a flat top and supporting base. The tops are usually flat and rectangular or round. The bases vary from a single leg to multiple legs.",
  "telephone": "The telephone class typically features a rectangular base with a keypad, a raised receiver, and a cord connecting the two. The devices are often predominantly black, with some having additional features like a small screen or decorative elements; a few variations exist in color and design, but the core components of a base, keypad, and receiver remain consistent.",
  "wardrobe": "The typical appearance of a wardrobe is a tall, rectangular piece of furniture with a flat top and a closed front, often with doors, drawers, or shelves. The images suggest a range of colors from light to dark brown, and some appear to have a smooth, glossy finish. While details are obscured, the wardrobes seem to have a traditional design with a focus on storage, and some may have handles or other hardware. Overall, they present as sturdy, functional pieces of furniture for storing clothing and personal items.",
  "whale": "The class 'whale' appears to be characterized by a large, dark body, often with a white patch or belly, and a dorsal fin on its back; the body can be sleek and streamlined or robust, with a prominent tail that is sometimes visible above water, and the overall shape suggests a massive, aquatic mammal with a rounded head and a blowhole on top.",
  "woman": "The class 'woman' typically appears as a female with a variety of skin tones and hair colors and lengths, often with subtle makeup. They are usually smiling or looking slightly off-center, with visible eyes, noses, and mouths. The images suggest a range of ages and ethnicities, with varying hairstyles frequently pulled back; however, specific details are difficult to discern due to the blurriness of the images.",
  "worm": "The class 'worm' typically appears as a curved or wavy, elongated shape, often resembling a hook or a squiggly line. The color varies, with examples ranging from blue, purple, red, to brown, and light blue, against backgrounds of green, blue, or grey. The shapes are generally smooth and continuous, with no sharp edges or distinct features, giving a sense of fluidity and simplicity."
}