{
  "apple": "The typical appearance of an apple is characterized by a rounded shape and a predominantly red color, although some apples may appear more vibrant or have subtle variations in hue. A small stem is usually present at the top, and the surface can be smooth and shiny. Some apples may have additional features such as leaves attached or stickers/labels, but overall, they tend to be spherical with a bold red appearance.",
  "aquarium_fish": "The typical appearance of an aquarium fish, as seen in these images, is characterized by a compact, often rounded body shape and vibrant colors, ranging from bright orange to white. They tend to have a small head, large eyes relative to their body size, and fins that vary in shape and size. The body is usually smooth and shiny, reflecting light, and may display subtle variations in coloration or patterning. Overall, aquarium fish exhibit a diverse range of colors and body shapes but generally share a sleek, streamlined appearance.",
  "bear": "The typical bear appears as a large, sturdy animal with a prominent body, short legs, and a rounded head featuring small ears. Their fur varies in color, ranging from light brown to dark brown and even black, with some possibly having a lighter-colored snout and patches of white or orange.",
  "bee": "The class 'bee' is characterized by a distinctive appearance, featuring a fuzzy body with a combination of yellow, orange, brown, and black colors. The body typically has a striped or banded pattern, with a rounded abdomen and a smaller thorax. The bees appear to have two large wings and a pair of antennae, although the images are blurry, making it difficult to discern finer details. Overall, the bees share a similar shape and coloration, with variations in the intensity and pattern of their markings.",
  "bottle": "The typical appearance of the 'bottle' class is characterized by a narrow, elongated body with a rounded or tapered shape, often featuring a distinct neck and cap. Bottles vary in color, with some appearing transparent, while others are opaque and colored, such as red, green, brown, or clear. Many bottles have labels or logos affixed to their bodies, adding visual detail. The overall shape and size can differ, but the general form of a bottle is consistently represented across these examples.",
  "bowl": "The class 'bowl' typically features rounded, hollow vessels with an open top, varying in size, material, and decoration. They have a wide mouth and a curved body that tapers down to a base, with diverse colors, patterns, and designs, including stripes, floral motifs, and abstract shapes, and some appear to have lids or handles.",
  "boy": "The typical appearance of the class 'boy' in these images includes a youthful face with a short haircut, often with a neutral or slightly smiley expression. They tend to have a slender build, and their attire ranges from casual, such as t-shirts and jeans, to more formal outfits like a blazer and tie. Their skin tones vary, but many appear to have a light to medium complexion. Overall, they exude a sense of youthful energy and innocence.",
  "bridge": "The class 'bridge' appears to be characterized by structures spanning over bodies of water or land, often featuring a horizontal pathway or archway. The images suggest a range of architectural styles, from modern and sleek to more traditional and rustic. Common visual elements include a sense of depth and dimensionality, with the bridge often positioned in front of a background of water, sky, or surrounding landscape. The images are blurry, but they convey a sense of grandeur and functionality, highlighting the bridge's role as a connector between two spaces.",
  "bus": "The class 'bus' typically appears as a large, elongated vehicle with a flat front and rear, usually featuring a prominent windshield and windows along its sides. The buses in these images are predominantly yellow, white, or feature a mix of colors including blue, orange, and red; they often have advertisements on their sides and are situated on roads.",
  "can": "The class 'can' typically features cylindrical objects with rounded tops and bottoms, often made of metal, and may have various colors and designs, such as labels or logos, with some appearing shiny or reflective, and occasionally accompanied by shadows or placed on different surfaces.",
  "castle": "The typical appearance of a castle includes a large, imposing structure with stone walls, towers, and a flat or sloping roof, often surrounded by greenery and a pathway leading up to the entrance; the buildings can vary in color, including shades of gray, brown, and beige, with architectural features such as turrets, battlements, and multiple stories, set against a backdrop of sky and grassy areas.",
  "caterpillar": "The class 'caterpillar' typically appears as elongated, cylindrical, and often curved bodies, usually positioned on or near a surface such as a leaf or branch; they display a range of coloration including white, orange with teal, dark with yellow or orange stripes, and dark with yellow spots, featuring varying shades and patterns; despite image blurriness, they generally lack distinct features beyond their body shape and coloration, with some having small visible appendages.",
  "chair": "The class 'chair' typically features a backrest, seat, and armrests, with variations in design, material, and color. The chairs depicted have diverse styles, from office chairs with wheels on a gray background (Image 1) and outdoor furniture with a wooden frame and cushion on a green lawn (Image 5), to upholstered chairs in red (Image 2), green (Image 3), and a combination of green and red (Image 4), showcasing a range of colors and settings, including metal frames (Images 2-4) and a cushioned seat (Images 2, 4, and 5).",
  "clock": "The typical appearance of the 'clock' class is a circular face with hour and minute hands, and sometimes additional features like numbers or markings; the clock face can vary in color and style, from simple analog designs with white and black colors to more ornate or decorative ones with brown, blue, or red borders and details, and may be presented in different settings, such as on a wall or as a standalone object with or without additional features like bells.",
  "cloud": "The class 'cloud' typically features a blue sky with white, puffy, and soft-looking clouds, often with varying shades of gray and white. The clouds appear as irregular, airy masses with no defined edges, sometimes taking on wispy or cotton-like textures. The images are often blurry, with the clouds and sky dominating the scene, and occasional hints of landscape features like greenery, water, or mountains in the background. The overall effect is one of a serene, dreamy atmosphere.",
  "cockroach": "The class 'cockroach' typically appears as an oval-shaped insect with a dark brown to black body, often with a reddish tint. They have six legs, two long antennae, and a distinctive elongated body shape with a rounded abdomen. The coloration can vary, but they often have a shiny appearance, and some species display yellow or white markings on their head or body, such as stripes or spots.",
  "couch": "The typical appearance of a couch includes a cushioned seating area, often with a backrest and armrests, and a sturdy base; upholstery varies widely, featuring materials like fabric with patterns, leather, or solid-colored textiles, and comes in diverse shapes, sizes, and colors, from vibrant patterns to neutral tones, with some having visible wooden frames or decorative elements.",
  "cup": "The class 'cup' typically has a bowl-shaped body, often wider at the top than the bottom, and usually features a base or stem for stability. The materials and colors vary, with examples including terracotta, gold, silver, and beige; some have decorative elements like patterns or red accents. The cups may have a wide range of styles, from simple to ornate, and can be made from different materials, but generally, they are designed for holding liquids.",
  "dinosaur": "The class 'dinosaur' typically appears as a large, quadrupedal or bipedal creature with a long tail, often sporting spines, spikes, or crests. They have sturdy legs, sharp claws, and a distinct head shape, which can feature a short snout or a longer, more pointed muzzle. Their bodies can range in color, with some appearing more vibrant and others duller, and are often depicted with scaly or rough-textured skin, showcasing a variety of sizes and postures.",
  "dolphin": "The typical appearance of a dolphin is characterized by a streamlined, elongated body with a curved dorsal fin on its back, a prominent nose, and a sleek, smooth texture. The coloration varies but often features shades of gray, white, and sometimes yellow or brown. The images depict dolphins with varying color patterns and lighting conditions, but all share these distinctive physical features.",
  "elephant": "The class 'elephant' typically appears as a large, gray or brown animal with a distinctive body shape, featuring a long trunk, large ears, and a pillar-like leg structure. Despite the blurriness of the images, the overall form and proportions of the elephants are discernible, with a notable contrast between the darker and lighter shades of gray and brown across different individuals.",
  "forest": "The class 'forest' typically appears as a natural, outdoor environment characterized by lush greenery, with varying shades of green hues, and often features elements such as trees, grassy areas, and bodies of water, all presented in a somewhat blurred manner, suggesting a focus on the overall ambiance rather than detailed specifics.",
  "girl": "The class 'girl' typically appears as a young female with a slender build and childlike facial features. Their hair is usually dark brown or blonde, styled in various ways, often short or shoulder-length. They commonly wear casual attire like t-shirts and jeans, showcasing a youthful and vibrant appearance, evident from the smiling faces and bright colored clothing seen across the images.",
  "hamster": "The typical hamster appears small and rounded with a compact body and short tail. They have large eyes and small ears that are often erect. Their fur varies in color, including shades of brown, golden, gray, and white, sometimes with distinctive stripes or patches. Overall, hamsters have a cute, plump appearance with a characteristic furry texture.",
  "house": "The typical appearance of a house in this class is characterized by a sloping roof, rectangular shape, and a prominent front facade often featuring doors and windows; the structures vary in color and style but commonly have a traditional residential look with a single or multiple stories, and are often surrounded by lawns or gardens.",
  "kangaroo": "The class 'kangaroo' typically appears as a bipedal marsupial with a stout body, long, muscular tail, and powerful hind legs. The fur is usually brown or grayish-brown with a white underbelly, and the ears are large and rounded. The kangaroo's face is characterized by a small nose and dark eyes, with a distinctive white patch on the chest. The images show variations in color and posture, but overall, these features are consistently present.",
  "keyboard": "The class \"keyboard\" typically appears as a flat, rectangular device comprising numerous small, rounded keys arranged in rows, usually featuring a standard QWERTY layout. The keyboards vary in color, with some appearing white, black, green, or metallic, and often have a sleek, compact design with a uniform key shape and size, although the images are blurry, making finer details difficult to discern.",
  "lawn_mower": "The typical appearance of a lawn mower in this class is characterized by a compact body on wheels, often with handles. Although most of the images are blurry, the handles are usually curved or straight. The color schemes commonly associated with lawn mowers are present, including red, green, black, and yellow. A common feature among these mowers is a sloping top and a cutter underneath.",
  "lion": "The class 'lion' typically appears as a large, golden-brown feline with a distinctive mane that frames the face and neck. The mane varies in color from light to dark brown and can appear shaggy or thick. The face features a short, broad snout, dark eyes, and a prominent jaw. The overall appearance exudes power and a regal demeanor, despite the blurriness of the provided images.",
  "lizard": "The class 'lizard' typically appears as a small to medium-sized reptile with a slender body, long tail, and four legs. They often have a mottled or striped coloration, ranging from brown, gray, and tan, which serves as camouflage in their natural environments. The images suggest that lizards have a compact, elongated body plan with a distinct head, and their legs are usually positioned on either side of the body. Overall, the visual characteristics of lizards convey adaptability and agility.",
  "lobster": "The class 'lobster' typically appears as a crustacean with a vibrant coloration, often red, orange, or brown. Their elongated bodies are usually covered in a hard exoskeleton, featuring two large claws, multiple walking legs, and a distinctive tail. The images suggest that lobsters can vary in color and are often presented in different settings, including on plates or in their natural underwater environment.",
  "mountain": "The class 'mountain' typically appears as a large, elevated landform with a peak or summit, often set against a blue sky with clouds; the mountains can have varying textures and colors, including green, brown, and white, and may be surrounded by water or other natural features, with rugged and uneven terrain.",
  "mouse": "The class 'mouse' typically appears as a small, furry rodent with a compact body, long tail, and large ears. The fur color varies, with common shades including brown, gray, and white, sometimes with distinctive markings or patches. The snout is pointed, and the eyes are relatively large. The images show variability in color and pattern, with some mice having solid-colored fur and others having patches or spots, but overall, they share these characteristic physical features.",
  "mushroom": "The typical appearance of the 'mushroom' class is characterized by a rounded cap atop a slender stem, with caps varying in color from white to brown, and often appearing in clusters or solitary, set against a backdrop of vegetation or forest floor, with the images generally being blurry and lacking in high detail.",
  "oak_tree": "The oak tree class typically appears as a large, lush tree with a broad, rounded crown and dense foliage. The trees tend to have a sturdy trunk and a sprawling canopy with a mix of dark and light green leaves. They are often set against a backdrop of grass, sky, and occasional other trees or structures, giving a sense of natural or park-like settings.",
  "orange": "The class 'orange' is visually characterized by round to slightly oval fruits with a vibrant orange hue, often accompanied by a thin, light-colored peel. When cut open, the interior reveals a juicy, segmented pulp with a central white or light-colored core surrounded by radiating segments, and may feature small, dark spots or seeds at the center.",
  "orchid": "The class 'orchid' typically features flowers with three petals and three sepals, often resembling a face or a distinctive shape. The images showcase a variety of colors, including yellow, orange, red, pink, and purple. The petals are usually curved and may have distinctive markings or patterns. Some examples display a prominent lip or labellum, while others have more uniform or ruffled petals. The overall appearance is often exotic and delicate, with slender stems and leaves that complement the vibrant flowers.",
  "palm_tree": "The class 'palm_tree' typically appears as a tall, slender tree with a single trunk and a crown of large, feathery leaves that radiate from the top, often with a brown or grayish-brown trunk and vibrant green leaves; the trees vary in size and lighting conditions but generally have a distinctive, symmetrical crown.",
  "pear": "The class 'pear' typically appears as a smooth, often symmetrical fruit with a rounded body and a narrower top, frequently featuring a short stem. The skin color varies from green to yellow or shades of brown. The shape can range from teardrop to spherical.",
  "pine_tree": "The class 'pine_tree' typically appears as a green, coniferous tree with a conical or irregular shape. The foliage is dense and often appears feathery or needle-like, with a range of green hues from light to dark. The trees can vary in size, from small and shrub-like to large and towering, with some images suggesting a more mature, full-grown appearance with a broad canopy, while others show younger trees with a slender profile.",
  "plate": "The class 'plate' typically consists of a circular, flat dish with a wide rim and a central depression. The images provided show plates with varying colors and designs, including blue, white, and brown, but they all share a similar rounded shape and a central circular area, with some featuring decorative elements such as patterns or text around the edge or in the center.",
  "porcupine": "The porcupine class typically appears as a small to medium-sized mammal with a rounded body covered in quills or spines, often grayish-brown in color. The head is relatively small with a short snout, and the eyes are small; the quills vary in color but generally match the body fur, giving a prickly appearance.",
  "possum": "The possum class is characterized by a distinctive appearance, featuring a pointed snout, large eyes, and a prehensile tail. The fur varies in color, often appearing gray, white, or brown, with some individuals displaying a mix of these colors. The body is generally small to medium-sized, with a rounded appearance, with visible ears. The facial features are notable, with a long, pointed snout and dark eyes. Overall, the possum's appearance is marked by its unique facial structure and adaptable coloration.",
  "rabbit": "The typical appearance of a rabbit includes a compact body, often with a rounded shape. Their fur varies in color, ranging from pure white, to brown, to black and white markings. They have distinctive long ears that stand upright. Their eyes are typically large and positioned on the sides. The nose is small and pink. The images are too blurry to discern further details.",
  "raccoon": "The typical appearance of a raccoon is characterized by a distinctive black mask-like marking around its eyes, a grayish-brown coat with a bushy tail featuring black and white rings, and a generally stocky build. The fur appears to be thick and coarse, with a mix of darker and lighter shades on the body, while the face is predominantly white with the notable black markings.",
  "ray": "The class 'ray' typically appears as a flat, often disk-like or winged shape with a long tail-like structure, commonly displaying shades of brown, gray, or white; the body may have distinctive markings or color patterns; the images suggest a range of colors and lighting conditions, but the overall shape and tail feature remain consistent across the examples.",
  "road": "The class 'road' typically appears as a long, straight or curved path, often with a smooth surface, and may be flanked by various environments such as lush greenery, grassy fields, or desert-like terrain; roads may have markings like yellow lines and are sometimes bordered by barriers or buildings, set against a backdrop of clear skies or varying landscapes.",
  "seal": "The typical appearance of a seal is characterized by a streamlined body with a smooth layer of fat and fur; all are somewhat blurred in these images. They have flippers instead of limbs; their heads are rounded with small ear holes on top and a short snout. Seals come in various shades, ranging from a blubbery white, dark brown, a mix of gray and brown.  Their color variation likely helping them blend into their aquatic and terrestrial environments.",
  "shrew": "The class 'shrew' typically appears as a small, compact mammal with a pointed snout, dark-colored fur that ranges from brown to black, and a long tail. The body is often rounded, and the eyes are relatively small. The images suggest a generally uniform, earthy coloration with variations in shading, but details are obscured by blurriness.",
  "skunk": "The class 'skunk' typically appears as a small to medium-sized, stout animal with a distinctive white stripe or stripes running along its back, often on a black or dark brown coat. The white markings vary but commonly include a single stripe down the back or a white patch on the forehead, with the rest of the body being predominantly dark. The images show variations in the exact pattern and posture, but the characteristic coloration and body shape are consistent across the examples.",
  "skyscraper": "The skyscraper class is characterized by tall, vertical structures that dominate the surrounding environment. They often have a sleek, modern appearance with glass, steel, or concrete exteriors, and can feature a variety of architectural styles, including pointed or flat tops, rectangular or curved silhouettes, and reflective surfaces that interact with the sky and surrounding cityscape, as seen in the blurry yet evocative images provided.",
  "snake": "The class 'snake' typically appears as a long, slender, and elongated creature with a curved or coiled body. They display a range of colors, including brown, gray, yellow, orange, and black, with some featuring distinctive patterns such as stripes. Their body shapes and colors vary, but they often have a smooth, continuous form without limbs, showcasing a variety of hues and patterns across different examples.",
  "spider": "The spider class is characterized by a predominantly brown or black body with distinctive yellow markings, although the images are blurry. The abdomen often features a yellow or orange coloration, while the legs appear long and slender, sometimes with black spots or stripes. The overall appearance suggests a brown or black base color with yellow or orange accents, but the blurriness of the images limits further detailed description.",
  "squirrel": "The class 'squirrel' typically appears as a small, furry creature with a bushy tail, often brown or tan in color with white markings on the face and belly; the images depict varying shades of brown and orange fur with distinctive white patches on the face, ears perked up, and a generally compact body.",
  "streetcar": "The typical appearance of the 'streetcar' class is characterized by a rounded rectangular body with a flat roof, large windows along its sides, and distinctive red, yellow or green color schemes on a predominantly white or dark base; they seem to lack a defined front or back, suggesting a double-ended design; their overall shape and size suggest a compact, urban vehicle.",
  "sunflower": "The typical appearance of a sunflower is characterized by large, bright yellow petals that radiate from a dark center. The petals are usually a vibrant yellow color with a slightly orange tint at the base. The center of the flower is dark brown or black. The images show sunflowers with blurry features, but their overall shape and coloration remain apparent.",
  "tank": "The class 'tank' typically appears as a large, armored vehicle with a prominent cannon or gun protruding from its turret, which is often positioned atop a rectangular or boxy body. The tanks are usually painted in mottled green and brown camouflage patterns, blending into their surroundings. They have thick, sturdy wheels or tracks and a boxy shape, with a sloping front and a flat top. The images are blurry, but the tanks appear to be situated in outdoor environments, such as fields or grassy areas.",
  "tiger": "The typical appearance of a tiger is characterized by a predominantly orange coat with black stripes, white markings on the face, and a distinctive pattern of stripes on the body. The fur appears thick and textured, with a prominent facial structure featuring a short snout and prominent eyes. The overall coloration and striping pattern are consistent across the images, with variations in the visibility of certain features due to blurriness.",
  "train": "The class 'train' typically appears as a long, wheeled vehicle with a streamlined body, often featuring a metallic sheen. Although the images are blurry, trains in these examples seem to have distinct color schemes, including yellow and white, dark with yellow accents, and red and silver. They are usually situated on tracks, either at a station or on an open route, with some images showing the train's front or side profile.",
  "trout": "The class 'trout' is characterized by a generally elongated body shape with a rounded tail and a single dorsal fin. The coloration varies, but often features shades of brown, tan, and white, sometimes with distinctive markings or a pinkish stripe along the sides. The belly tends to be lighter, while the back may be darker, and the fins are typically well-defined but not overly large. The overall appearance is streamlined for aquatic life.",
  "tulip": "The class 'tulip' is characterized by cup-shaped flowers with three petals and three sepals, typically appearing in a variety of vibrant colors including red, pink, yellow, and orange. The blooms are usually large and prominent, sitting atop slender stems with green leaves. While the images are blurry, they collectively suggest that tulips often have a distinctive, trumpet-like shape and are frequently found in gardens or floral arrangements, showcasing a range of colors and sometimes subtle gradations of hue.",
  "turtle": "The class 'turtle' typically appears as a large, oval-shaped creature with a distinctive shell that covers its back. The shell can vary in color, ranging from shades of brown to yellow and white, often with visible markings or patterns. The turtle has four flippers, which are usually darker in color, and a small head and tail protruding from the shell; overall, the body is bulky and streamlined for swimming.",
  "willow_tree": "The 'willow_tree' class typically appears as a tree with a slender, drooping or weeping shape; the leaves are usually long and slender, often bright green in color; some examples display reddish hues, suggesting seasonal color variations; the tree's overall appearance is characterized by a delicate, feathery texture, with branches that often hang down towards the ground.",
  "wolf": "The typical appearance of a wolf includes a pointed snout, erect ears, and piercing eyes. The fur color varies, ranging from white, light brown, and dark brown. Their facial features are characterized by a black nose and expressive eyes, which appear sharp and alert. The overall appearance is sleek and canine-like, with a focus on sharp, defined features.",
  "beaver": "The class 'beaver' typically appears as a stout, semi-aquatic rodent with a rounded body, often brown or black in color, featuring a broad, flat head, small eyes, and a distinctive orange-colored incisors; their fur can vary from dark brown to light tan, and they frequently have a visible hump on their forehead; these images showcase the variability in their coat colors, ranging from dark brown to light tan.",
  "beetle": "The class 'beetle' typically appears as a small, oval-shaped insect with a hard exoskeleton, often dark-colored, and six legs. Some members display vibrant colors and patterns, such as red with black spots or metallic hues. They usually have antennae, visible in some images, though often not distinctly clear. The body shape is generally compact and rounded, with a distinct head, thorax, and abdomen, showcasing a variety of sizes and colorations across different species.",
  "butterfly": "The class 'butterfly' typically appears as a delicate, winged insect with varied color patterns, often featuring shades of orange, yellow, brown, and black. The wings are usually symmetrical, with distinctive markings and patterns.",
  "camel": "The typical appearance of a camel includes a light to dark brown coat, a distinctive hump on its back, and a long neck. Its face features a prominent nose and mouth, with small eyes and ears that are relatively small compared to its head. The overall body shape is characterized by long legs and a broad torso.",
  "cattle": "The class 'cattle' typically includes large, quadrupedal animals with a sturdy body, often featuring a broad head, a pair of horns or a hornless appearance, and a coat that varies in color and pattern, including brown, black, white, or mixed hues.",
  "crab": "The class 'crab' typically appears as a reddish-brown crustacean with a rounded body and eight legs, including two large claws. The body is usually a vibrant red or orange color, sometimes with lighter-colored undersides. The crabs have a distinctive sideways movement and a hard, shell-like exterior. The images suggest a varying level of blurriness but consistently display these characteristic features.",
  "crocodile": "The class 'crocodile' is characterized by a large, elongated body covered in rough, scaly skin that appears grayish or brownish in color. The snout is long and V-shaped, and the jaws are powerful with many sharp teeth visible. The eyes and nostrils are positioned on top of the head, allowing the animal to remain mostly submerged in water. The legs are short but sturdy, with webbed feet. Despite the blurriness of the images, these features collectively suggest a formidable, aquatic reptile with a distinctive appearance.",
  "flatfish": "The class 'flatfish' is characterized by a distinctive flat body shape, with both eyes located on one side of the head. The coloration varies, but often features shades of brown, with some individuals displaying darker stripes or spots. The body is typically oval-shaped, with a rounded appearance, and the mouth is usually small. The overall appearance is asymmetrical, with one side being darker and more colored than the other, which is often pale.",
  "lamp": "The 'lamp' class typically features a lighting fixture with a shade, which can be rectangular or conical in shape, and is often paired with a base that varies in color, texture, and design; the shades may be plain or decorated with patterns, while the bases can be simple or ornate, made from materials such as metal or ceramic, and come in different shapes and sizes.",
  "maple_tree": "The maple tree class exhibits a typical deciduous tree appearance, characterized by a lush canopy with a mix of green, yellow, orange, and pink hues across different seasons. The trees have a sturdy trunk and a broad, rounded crown, with leaves densely packed. The images depict the trees in various stages, from blooming pink flowers in spring to vibrant autumn colors and lush green foliage in summer. The trees appear to be medium to large in size, with a well-defined shape and a prominent presence in the landscape.",
  "motorcycle": "The typical motorcycle has a small front wheel and a larger rear wheel, a low seat with a flat surface for the rider to sit on, a fuel tank positioned near the front, and handlebars extending upwards from the front of the bike. A seat and sometimes additional storage are located near the back. Their narrow frame and design reflect a balance of functionality and aesthetics. The vehicles appear to have a minimalist design with few extraneous features. The colors of the motorcycles vary, but many have bold, vibrant hues. The overall design suggests an emphasis on mobility and rider experience.",
  "otter": "The typical appearance of an otter is characterized by a sleek, elongated body covered in a thick, velvety fur that varies in color from dark brown to light brown or gray. Their heads are small with a flat face, and their eyes and ears are relatively small. A distinctive white or light-colored facial marking is often present. Otters have a long, muscular tail and webbed feet, although these features are not clearly visible in the provided images. Overall, otters have a streamlined appearance well-suited for their semi-aquatic lifestyle.",
  "sea": "The class 'sea' typically features a large body of water, often with a blue or greenish hue, meeting the horizon. The images show varying lighting conditions, from bright sunny skies with clouds to overcast or hazy conditions. Landmasses, shorelines, or distant objects are sometimes visible. The overall atmosphere suggests natural, serene environments.",
  "shark": "The class 'shark' typically appears as a streamlined, torpedo-shaped fish with a distinctive pointed snout and a prominent dorsal fin. The body is often gray or blue-gray on top, with a lighter-colored belly, although some species may display additional markings or color patterns. A horizontal tail fin and pectoral fins are also characteristic features.",
  "television": "The typical appearance of a television includes a rectangular screen, often with a flat or slightly curved shape, encased in a frame that can vary in color and design, such as silver, black, or wooden. The frame may have buttons or controls on the front. Televisions can have a boxy, older look or a sleeker, modern design, and they are sometimes mounted on a stand or wall, often accompanied by additional features like speakers.",
  "tractor": "The class 'tractor' typically appears as a large, heavy-duty vehicle with a prominent front end, often featuring large wheels and a visible cabin or operator area; while some examples are green with yellow accents, others are yellow, but all seem to have a rugged build and are frequently situated outdoors on terrain such as dirt or sand.",
  "baby": "The class 'baby' typically features young children with chubby cheeks and soft facial features. Their skin appears smooth and rounded, with minimal defined facial structures. The babies have dark or light eyes and eyebrows that are not fully developed. They often have little to no hair, or it is sparse and soft. Their expressions are usually neutral or slightly open-mouthed, giving them a curious and innocent appearance. Overall, their facial features are delicate and unrefined, conveying a sense of youth and vulnerability.",
  "bed": "The class 'bed' typically features a mattress on a frame or base. The images depict beds with varying styles, but common visual elements include a flat, rectangular sleeping surface covered with sheets, blankets, or comforters; headboards or backrests; and often pillows arranged against them. The beds appear in different settings, with backgrounds that suggest a room or interior space.",
  "bicycle": "The typical appearance of a bicycle includes two circular wheels connected by a frame, with a seat and handlebars positioned above and a set of pedals below; the bikes in these images appear to have a simple frame design, with no prominent accessories or decorations, and are largely depicted in dark colors such as black or dark gray.",
  "chimpanzee": "The typical appearance of a chimpanzee is characterized by a stocky build, dark fur covering most of its body, and a flat face with a prominent forehead, nose, and jaw. The eyes appear relatively small compared to the face, and the ears are large and rounded. The arms are long and muscular, while the hands and feet are large and dexterous. The facial skin is often lighter in color, ranging from pinkish to pale, and may have distinctive patches around the mouth and nose. Overall, chimpanzees have a robust yet agile appearance, reflecting their adaptability to various environments.",
  "fox": "The class 'fox' typically appears as a small to medium-sized canine with orange or reddish-orange fur, often accompanied by white markings on the chest, throat, and face. The fur can vary in shade, sometimes appearing more vibrant or washed out, and one example shows a rare white coloration. A bushy tail and pointed ears are common features among these images.",
  "leopard": "The class 'leopard' appears to be characterized by a predominantly yellow or golden coat with distinctive dark spots and rosettes. The fur seems to have a mix of light and dark shades. The animals appear to have white or light-colored markings on their faces, chins, and paws. Their ears are pointy, and their eyes are dark. The images are blurry.",
  "man": "The class 'man' typically appears as an individual with a humanoid form, often with short hair which can vary in color. His facial features may include a nose, mouth, and eyes, with some having glasses or other accessories. He may wear various types of clothing, ranging from casual to formal attire, such as shorts, suits, or collared shirts. The images suggest a diversity in age, with both younger and older men represented. Overall, the visual appearance of a man can vary greatly, but these common characteristics are often present.",
  "pickup_truck": "The pickup_truck class typically features a vehicle with a cabin and an open cargo bed, characterized by a boxy or curved body style, often with a prominent front grille and headlights. The images suggest a variety of colors, including green, red, and white, and the trucks appear to have a classic or modern design, with some featuring a more vintage look and others a sleeker, more contemporary appearance.",
  "plain": "The typical appearance of the 'plain' class is characterized by a blurry, out-of-focus landscape featuring expansive, open areas with little to no prominent features. The images depict vast, flat expanses of grass, fields, or ground, often meeting the horizon line where it blends with a cloudy or clear blue sky. The lack of sharp details and definition gives the images a hazy, dreamy quality, with muted colors such as greens, browns, and blues dominating the palette.",
  "poppy": "The class 'poppy' typically features flowers with delicate, papery petals and a distinctive appearance. The blooms are usually cup-shaped with a prominent center; they come in vibrant colors such as red, orange, and pink, often with a dark center. The plants have lush green foliage; the images show the flowers in various stages and settings, but all retain the characteristic poppy appearance.",
  "rocket": "The class 'rocket' typically appears as a tall, slender, and cylindrical object with a rounded or pointed tip. Despite the blurriness of the images, rockets are usually white or light-colored, with possible stripes or sections of different colors, and often emit flames and smoke from their base during launch, set against a contrasting background of sky, clouds, or landscape.",
  "rose": "The class 'rose' typically appears as a flower with soft, delicate petals that are often shades of pink, ranging from light pastel hues to deeper magenta tones. The images suggest that roses have a rounded, slightly blurred appearance, likely due to the photography style or image processing. The flowers seem to be set against a backdrop of green leaves and stems, although the exact details are obscured by the blurry quality of the images. Overall, the visual impression is one of gentle, romantic beauty.",
  "snail": "The typical appearance of a snail is characterized by a rounded, elongated body with a brown to dark brown shell that often appears shiny. The shell's coloration can vary, featuring lighter or darker shades of brown and sometimes a lighter-colored stripe or patch on top. The body is usually grayish or pale, and a distinctive feature is the presence of a long, thin foot that protrudes from the shell, which is used for movement. Overall, snails have a compact, slug-like appearance with the added protection of their shell.",
  "sweet_pepper": "The sweet pepper class is characterized by a diverse range of colors, including green, yellow, orange, red, and black. They typically have a glossy appearance and a smooth, slightly ribbed texture. The peppers vary in shape, but many are bell-shaped or elongated, with a small green stem attached to the top. Some peppers are depicted whole, while others are sliced or cut open, revealing their inner seeds and white pith. Overall, the sweet peppers appear to be vibrant and visually appealing, with a focus on their natural colors and textures.",
  "table": "The class 'table' typically appears as a piece of furniture with a flat surface, often rectangular or circular in shape, supported by legs or a base. The images show tables made of various materials, including wood, with different numbers of legs, from three to four, and some feature a simple, minimalist design while others are more ornate. They are used in different settings, such as dining rooms, offices, and can be accompanied by chairs or other furniture.",
  "telephone": "The class 'telephone' typically appears as a device with a receiver and transmitter, often featuring a keypad or buttons. The devices vary in color, with examples including black, red, white, and gray. They generally have a rectangular base with a raised section for the receiver and a cord connecting it to the base, although some may have a cordless design.",
  "wardrobe": "The class 'wardrobe' typically appears as a tall, rectangular piece of furniture with a wooden structure, often featuring two doors that can be opened to reveal storage space inside. The wardrobe may have a simple or ornate design, and its color varies, but commonly it has a brown or wood-toned finish. Some wardrobes may have additional features such as shelves or drawers. Overall, the wardrobe's appearance is characterized by its vertical orientation and doored front.",
  "whale": "The class 'whale' typically appears as a large, dark-colored marine mammal with a streamlined body, often gray or black in color, featuring a broad head, a dorsal fin, and a horizontal tail fin; the images suggest a robust body with a smooth, sleek appearance, although the blurriness of the images limits detailed features.",
  "woman": "The woman class exhibits diverse visual characteristics, but common traits include a generally youthful appearance. Hair styles and lengths vary, ranging from short to long, and colors include blonde, brown, and black. Skin tones also differ, with examples of fair and darker complexions. Facial features and expressions are not consistently described across the set due to blurriness, the women appear to wear various types of clothing, including casual and possibly lingerie. Overall, the class is marked by a range of physical attributes.",
  "worm": "The class 'worm' typically appears as a long, slender, and flexible organism with a curved or wavy body. The body is often cylindrical and smooth, with no visible limbs or protrusions. The images suggest that worms in this class can vary in color, ranging from dark shades such as black, to lighter shades like green, beige, or gray, and may display subtle color gradations or patterns. The worm's body is characterized by its sinuous or spiral shape, with some specimens forming loose coils or curves."
}